{
  "text": "burning a living thing usually causes harm to that living thing",
  "id": 910,
  "ChatGPT_query": "Please create a <question> that closely aligns with the provided <text>. Ensure that the <question> does not explicitly reference the text. You may incorporate specific scenarios or contexts in the <question>, allowing the <text> to serve as a comprehensive and precise answer.\n\n<text>: burning a living thing usually causes harm to that living thing\n\n<question>: ",
  "ChatGPT_response_0": "When a living organism is subjected to fire, it typically experiences harm. This harm can range from minor to severe injuries based on the exposure's intensity and duration. In the worst-case scenario, it can lead to the death of the organism. Even if survival is possible, the organism might suffer from long-term health issues related to the damage caused by the fire, such as respiratory problems, infections, or impairments to its recovery and function.",
  "query": "What is the usual consequence on a living organism when it is subjected to fire?",
  "ChatGPT_query_a": "You are KnowledgeGPT, equipped with in-depth knowledge. Your task is to directly answer the user's <question>. You can refer to the <referenced text> for your reply, but your response should not reveal that you have referenced the text. Ensure that responses are thorough, informative and as helpful as possible to users.\n\n<question>: What is the usual consequence on a living organism when it is subjected to fire?\n\n<reference text>: burning a living thing usually causes harm to that living thing\n\n<reply>: ",
  "response": "When a living organism is subjected to fire, it typically experiences harm. This harm can range from minor to severe injuries based on the exposure's intensity and duration. In the worst-case scenario, it can lead to the death of the organism. Even if survival is possible, the organism might suffer from long-term health issues related to the damage caused by the fire, such as respiratory problems, infections, or impairments to its recovery and function."
}